// Страшно? Не стоит бояться, вы справитесь. Внизу вы видите код той же самой программы на Go, которую мы рассмотрели на предыдущем шаге.
// Все что вам нужно сделать, это заменить слова Привет, Степик! на фразу  Я изучаю Go на Степике!
//
// Внизу справа, под окошком для введения кода, вы можете видеть черную кнопку "Запустить код".
// Попробуйте нажать на нее - эта кнопка позволит вам запускать код до его отправки на проверку и таким образом проводить тестирование ваших решений.

package main

import "fmt"

func main() {
	fmt.Println("Я изучаю Go на Степике!")
}
